CSI API ETABS v1
cCaseDirectHistoryNonlinear Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cCaseDirectHistoryNonlinear
Public Interface cCaseDirectHistoryNonlinear
Dim instance As cCaseDirectHistoryNonlinear
public interface class cCaseDirectHistoryNonlinear
type cCaseDirectHistoryNonlinear =  interface end
The cCaseDirectHistoryNonlinear type exposes the following members.
Methods
Name | Description
GetLoads
 Retrieves the load data for the specified load case
Top
See Also
Reference
ETABSv1 Namespace